let app1 = new Vue({
	el: '#app-1',
	data: {
		hearts:[
		"******❤️❤️❤️******",
		'**********❤️❤️**********',
		'*************❤️*************',
		'*****************************',
		'*****************************',
		'*****************************',
		'***************************',
		'***********************',
		'*******************',
		'***************',
		'***********',
		'*******',
		'***',
		'*',
		]
	},
	methods:{
		showHeart: () => {
			const num = Math.floor(Math.random() * 10);
			const sweet = [
				'爱你~么么哒',
				'喵喵真可爱~',
				'喵喵最好了！',
				'女王大人~节日快乐！',
				'真的好爱你~',
				'温柔漂亮可爱喵~',
				'聪明的喵喵~爱你~',
				'好喜欢你~喵喵~',
				'喵喵大人~棒棒哒~',
				'我爱你~喵喵~'
			];

			app2.seen = true;

			app2.message = sweet[num];
		}
	}
});

let app2 = new Vue({
	el: '#app-2',
	data: {
		seen: true,
		message: '六一快乐！'
	},
	methods: {
		hideWrap: function() {
			this.seen = false;
		}
	}
});